export type Question = {
    id: string;
    text: string;
    reverse?: boolean;
    scaleMin: number;
    scaleMax: number;
};

export const QUESTIONS: Question[] = [
    // Стрессийн түвшин (0..4)
    {
        id: "S1",
        text: "Та сүүлийн 7 хоногт стресс, сэтгэлийн дарамт мэдэрсэн үү?",
        scaleMin: 0,
        scaleMax: 4,
    },
    {
        id: "S2",
        text: "Сүүлийн долоо хоногт амьдралынхаа чухал зүйлсийг хянаж чадахгүй байсан уу?",
        scaleMin: 0,
        scaleMax: 4,
    },
    {
        id: "S3",
        text: "Та сүүлийн долоо хоногт сандрал, түгшүүр ихээр мэдэрсэн үү?",
        scaleMin: 0,
        scaleMax: 4,
    },
    {
        id: "S4",
        text: "Сүүлийн 7 хоногт та бэрхшээлийг даван туулахдаа өөртөө итгэлтэй байсан уу?",
        reverse: true,
        scaleMin: 0,
        scaleMax: 4,
    },
    {
        id: "S5",
        text: "Сүүлийн долоо хоногт та хэтэрхий их ачаалал, дарамт мэдэрсэн үү?",
        scaleMin: 0,
        scaleMax: 4,
    },
    // Сэтгэл ханамжийн түвшин (1..7)
    {
        id: "H1",
        text: "Сүүлийн 7 хоногт таны амьдрал таны хүссэн шиг явагдаж байсан уу?",
        scaleMin: 1,
        scaleMax: 7,
    },
    {
        id: "H2",
        text: "Сүүлийн долоо хоногт таны амьдралын нөхцөл байдал сайн байсан уу?",
        scaleMin: 1,
        scaleMax: 7,
    },
    {
        id: "H3",
        text: "Та сүүлийн 7 хоногт амьдралдаа бодитойгоор сэтгэл хангалуун байсан уу?",
        scaleMin: 1,
        scaleMax: 7,
    },
    {
        id: "H4",
        text: "Сүүлийн долоо хоногт амьдралдаа чухал, утга учиртай зүйлс хийсэн гэж боддог уу?",
        scaleMin: 1,
        scaleMax: 7,
    },
    {
        id: "H5",
        text: "Хэрэв амьдралаа дахин амьдрах боломж гарвал та юу ч өөрчилж чадахгүй гэж боддог уу?",
        scaleMin: 1,
        scaleMax: 7,
    },
    // Эмоционал оюун ухааны түвшин (1..5)
    {
        id: "E1",
        text: "Та сүүлийн 7 хоногт өөрийн сэтгэл хөдлөл, мэдрэмжийг сайн ойлгож чадсан уу?",
        scaleMin: 1,
        scaleMax: 5,
    },
    {
        id: "E2",
        text: "Сүүлийн долоо хоногт та бусдын сэтгэл санаа, мэдрэмжийг ойлгож чадсан уу?",
        scaleMin: 1,
        scaleMax: 5,
    },
    {
        id: "E3",
        text: "Сүүлийн 7 хоногт та сэтгэл хөдөлдөө автаж, тэвчээргүй хариу үйлдэл үзүүлдэг байсан уу?",
        reverse: true,
        scaleMin: 1,
        scaleMax: 5,
    },
    {
        id: "E4",
        text: "Та сүүлийн долоо хоногт уурлах, бухимдах үедээ өөрийгөө тайвшруулж чадсан уу?",
        scaleMin: 1,
        scaleMax: 5,
    },
    {
        id: "E5",
        text: "Сүүлийн 7 хоногт та бусдын шүүмжлэл, санал хүсэлтийг сайн хүлээж авсан уу?",
        scaleMin: 1,
        scaleMax: 5,
    },
];



export const GROUPS = {
    stress: ["S1", "S2", "S3", "S4", "S5"],
    happiness: ["H1", "H2", "H3", "H4", "H5"],
    eq: ["E1", "E2", "E3", "E4", "E5"],
};
